// /// 1.Вивести на сторінку в один рядок через кому числа від 10 до 20.///
let str = '';

for (let i = 10; i < 21; i++) {
    if (i > 10) {
        str += ', ';
    }
    str += i;
}

alert(str);
//
// ///2.Вивести квадрати чисел від 10 до 20.///
// let str = '';
//
// for (let i = 10; i < 21; i++) {
//     if (i > 10) {
//         str += ', ';
//     }
//     str += i ** 2;
// }
// alert(str)


///3.Вивести таблицю множення на 7.////////////////////
// let str = ''
//
// for(let i = 1; i < 11; i++){
//     console.log(`Multiply for ${i}`)
//     if (i < 11) {
//         str = (`7 * ${i} = ${7 * i}`)
//     }
//     console.log(str)
// }

///4.Знайти суму всіх цілих чисел від 1 до 15.////////////////////
// let sum = 0;
// for( let i = 1; i < 16; i++ ) {
//     sum += i;
// }
// console.log( sum );

///5.Знайти добуток усіх цілих чисел від 15 до 35.//////////////////////
// let mult = 1;
// for (let i = 15; i < 36; i++) {
//     mult = mult * i;
// }
// console.log(mult);

///6.Знайти середнє арифметичне всіх цілих чисел від 1 до 500.///////////////////////////
// let sum = 0;
// for( let i= 1; i<=500; i++) {
//     sum +=i;
// }
// console.log(sum / 500)

// ///7.Вивести суму лише парних чисел в діапазоні від 30 до 80./////////////////////////////
// for( let i= 30; i<=80; i++) {
//     if (i % 2 === 0) {
//         console.log(i)
//     }
// }


///8.Вивести всі числа в діапазоні від 100 до 200 кратні 3.///////////////////////
// for( let i= 100; i<=200; i++) {
//     if (i % 3 === 0) {
//         console.log(i)
//     }
// }


///9.Дано натуральне число. Знайти та вивести на сторінку всі його дільники.////////////
// let number = 50;
// for(let i = 1; i <=50; i++) {
//
//     if (number % i === 0 ) {
//         console.log(i);
//     }
// }
///10.Визначити кількість його парних дільників.////////////////////
///11.Знайти суму його парних дільників.///////////////////////
// let number = 50;
// let summ = 0;
// for(let i = 1; i <=50; i++) {
//
//     if (number % i === 0 && i % 2 === 0){
//         console.log(i);
//        summ += i;
//     }
// }
// console.log(summ);

///Task 12//////////////////////////
// for (let i = 1; i <= 10;  i += 1) {
//     console.log(`Multiply for ${i}`)
//     for (let j = 1; j <= 10; j += 1) {
//         console.log(`${i} * ${j} = ${i * j}`);
//     }
//     console.log();
// }
